# Gradle 环境与 Java/Kotlin

> ***"工欲善其事，必先利其器。"***

::: tip 
本教程涉及的为使用桌面端进行开发，如果是其他设备请移步[第五节](./4-build-on-android.md)
:::

虽说Mindustry是个挺不正常的Java项目，但是其 **构建（Build）** 系统还是比较正常的————使用的是Java世界中最流行的Gradle。本节教程将聚焦开发环境的配置，选择最适合您的开发方式。

## Java!

无论您做什么，基本的运行环境————Java是不可或缺的。

如果您曾经安装过Java，也不要高兴的太早，本教程的 Java 模组开发是基于**Java 21**的，而且必须是**JDK**，所以，最好先检查一下你的JDK版本。请在终端中输入`java -version`查看当前默认Java版本。

::: tip 终端
本教程中所称的*终端*，可以用来输入系统命令。在不同系统中，其位置也有所不同：
- 在Windows系统中，指的是`cmd.exe`。打开方法可以是按下`Win + R`组合键并输入`cmd`；
- 在macOS系统中，指的是`Terminal.app`。打开方法可以是按下`Command + 空格`，再输入`Terminal`；
- 在Linux系统中，我想你知道终端在哪。

值得注意的是，其他教程在指代系统命令中，常用一个`$`表示，本教程由于不涉及非系统命令，所以不加此区分。
:::

如果你确定自己是**JDK 21**，那么你可以开始下一步了。

如果你不曾安装过Java或者Java版本不正确，那你必须安装一个符合要求的Java。Java这门语言与其他一些语言不同，他只有执行标准，却没有所谓的官方实现，因此，市面上有琳琅满目的许多厂商的Java，都叫**JDK 21**，功能上没有差异，只是效率方面小有差别。目前，市面上比较流行的Java实现有`OracleJDK`、`OpenJDK`和`GraalVM`等等，但在本教程中，我们更推荐`Adoptium`!

### 安装 Adoptium

首先，让我们转入Adoptium的官网，那么Adoptium的官网是什么呢？

::: info 【课中探究案1-1-1】学会使用搜索引擎
只有上帝才有能力知道世间每一件事情，所幸你可以求助上帝————只需要打开搜索引擎。

搜索引擎的选择很重要，如果你对百度搜索结果前几条的推荐机制不太了解，恐怕Bing更适合你。

当然，如果你认准“官网”标志和看见“广告”二字，百度也是非常好用的工具。如果没有官网标志，那真的是很痛苦了。

本探究建议使用bing完成，课后可尝试用百度再来一遍，然后你就懂我为什么这么说了。

答案见下
:::

::: details 答案
https://adoptium.net/zh-CN/
:::

![adoptium-index](./imgs/adoptium/adoptium-index.png)

接下来，点击中间的“最新LTS发行包”。

下载得到的是一个安装包，解压并无脑点击Next即可成功安装。这样，无论你是否以前安装过Java，现在`JAVA_HOME`一定会指向新下载的Java 21了！

## IDEA

> 如果你更习惯于用命令行开发，可跳过本节。

安装完Java之后，可以说你的开发环境已经配置完了————至少你现在可以去控制台执行`<gradlew> jar`了。不过我打赌，除非你以前是个资深vim程序员，否则你不会喜欢在这种环境下开发的。这时候你就需要一个IDE（集成开发环境）了。和Java一样，IDE也有许多种，此处我们只探讨 **IntelliJ IDEA** 。

**IDEA**是Java开发的神。关于其安装教程并不值得本教程赘述，相关教程网络上已经分布了很多，请自行百度或选择以下外链观看，和刚才一样，我更推荐你自己去找这些东西：

::: details 外链
+ Windows端：[https://blog.csdn.net/m0_37220730/article/details/107589690]
+ macOS端：[https://blog.csdn.net/jackson_lingua/article/details/145177226]
+ Linux端：[https://blog.csdn.net/qq_43646721/article/details/108152206]
:::

不过先别急着去下载，关于IDEA仍然有两个问题需要说明：
+ Mindustry Mod开发只需要**社区版**功能，所以不必费时费力**甚至是费钱**去破解旗舰版；
+ 目前IDEA已经自带中文了，所以你在查询2024年以前的教程时要注意之。

## Gradle 和 Kotlin

虽然这才是标题的内容，但是这两样东西的配置方法是————不用配置。

只要Java正确安装，Gradle就会正常执行，同时也包括Kotlin。




<h2>高级：Scala</h2>

::: danger 极度警告
本内容极其不适合放在你的模组当中，正如你所见，此部分不出现目录中，将其放置在这里只是因为与本节内容相关。

除非你以前很了解Scala，否则千万不要使用Scala进行模组开发。
:::


